#+TITLE:     Marco Gualtieri / Log
#+AUTHOR:    Marco Gualtieri
#+EMAIL:     mgualt@math.toronto.edu
#+DATE:      2012-07-11 Wed
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:0 toc:nil ltoc:nil mouse:rgb(230,230,230) buttons:nil path:scripts/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+STYLE:  <link rel="stylesheet" type="text/css" href="stylesheet.css" />
	  

* COMMENT 
#+srcname: org-publish
#+BEGIN_SRC emacs-lisp
  (setq home "~/Dropbox/Web/mgualt-log")
  (setq org-export-html-style-include-default nil)
  (setq org-export-html-postamble nil)
  (setq org-publish-project-alist
          '(("mysite"
             :base-directory "~/Dropbox/Web/mgualt-log/content/"
             :base-extension "org"
             :recursive t
             :section-numbers nil
             :table-of-contents nil
             :publishing-directory "~/Dropbox/Web/mgualt-log/")
            ("css"
             :base-directory "~/Dropbox/Web/mgualt-log/"
             :base-extension "css"
             :publishing-directory "~/Dropbox/Web/mgualt-log/"
             :publishing-function org-publish-attachment)
            ("imgs"
             :base-directory "~/Dropbox/Web/mgualt-log/content/imgs/"
             :base-extension "jpg\\|gif\\|png"
             :publishing-directory "~/Dropbox/Web/mgualt-log/imgs"
             :publishing-function org-publish-attachment)
            ("docs"
             :base-directory "~/Dropbox/Web/mgualt-log/content/docs/"
             :base-extension "html\\|tex\\|bib"
             :publishing-directory "~/Dropbox/Web/mgualt-log/docs"
             :publishing-function org-publish-attachment)
            ("scripts"
             :base-directory "~/Dropbox/Web/mgualt-log/content/scripts/"
             :base-extension "js"
             :publishing-directory "~/Dropbox/Web/mgualt-log/scripts"
             :publishing-function org-publish-attachment)
            ("thewholedamnshow" :components ("mysite" "css" "imgs" "docs" "scripts"))))
#+END_SRC

#+RESULTS:
| mysite           | :base-directory | ~/Dropbox/Web/mgualt-log/content/         | :base-extension | org   | :recursive            | t                                | :section-numbers      | nil                           | :table-of-contents   | nil                    | :publishing-directory | ~/Dropbox/Web/mgualt-log/ |
| css              | :base-directory | ~/Dropbox/Web/mgualt-log/                 | :base-extension | css   | :publishing-directory | ~/Dropbox/Web/mgualt-log/        | :publishing-function  | org-publish-attachment        |                      |                        |                       |                           |
| imgs             | :base-directory | ~/Dropbox/Web/mgualt-log/content/imgs/    | :base-extension | jpg\  | gif\                  | png                              | :publishing-directory | ~/Dropbox/Web/mgualt-log/imgs | :publishing-function | org-publish-attachment |                       |                           |
| docs             | :base-directory | ~/Dropbox/Web/mgualt-log/content/docs/    | :base-extension | html\ | tex\                  | bib                              | :publishing-directory | ~/Dropbox/Web/mgualt-log/docs | :publishing-function | org-publish-attachment |                       |                           |
| scripts          | :base-directory | ~/Dropbox/Web/mgualt-log/content/scripts/ | :base-extension | js    | :publishing-directory | ~/Dropbox/Web/mgualt-log/scripts | :publishing-function  | org-publish-attachment        |                      |                        |                       |                           |
| thewholedamnshow | :components     | (mysite css imgs docs scripts)            |                 |       |                       |                                  |                       |                               |                      |                        |                       |                           |

